FeatherCore/nuttx/boards/arm/stm32h7rs/stm32h7s78-dk/src/stm32h7s78_xspi.c
/****************************************************************************
 * boards/arm/stm32h7rs/stm32h7s78-dk/src/stm32h7s78_xspi.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <inttypes.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <syslog.h>

#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/cache.h>

#include <arch/board/board.h>

#include "arm_internal.h"

#include "hardware/stm32h7rs_gpio.h"
#include "hardware/stm32h7rs_memorymap.h"
#include "hardware/stm32h7rs_rcc.h"
#include "hardware/stm32h7rs_xspi.h"

#include "stm32h7rs_xspi.h"
#include "stm32h7s78-dk.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define STM32H7S78_XSPI_STARTUP_PRESCALER       3u
#define STM32H7S78_XSPI_NOR_OPTIONAL_PRESCALER  0u
#define STM32H7S78_XSPI_PSRAM_OPTIONAL_PRESCALER \
        0u
#define STM32H7S78_XSPI_NOR_RESET_DELAY_MS      100u
#define STM32H7S78_XSPI_STATUS_TIMEOUT          1000000u

#define MX66UW1G45G_RESET_ENABLE_CMD            0x66u
#define MX66UW1G45G_RESET_MEMORY_CMD            0x99u
#define MX66UW1G45G_OCTA_RESET_ENABLE_CMD       0x6699u
#define MX66UW1G45G_OCTA_RESET_MEMORY_CMD       0x9966u
#define MX66UW1G45G_READ_ID_CMD                 0x9fu
#define MX66UW1G45G_READ_STATUS_CMD             0x05u
#define MX66UW1G45G_WRITE_ENABLE_CMD            0x06u
#define MX66UW1G45G_CFG2_WRITE_CMD              0x72u
#define MX66UW1G45G_CFG2_READ_CMD               0x71u
#define MX66UW1G45G_OCTAL_CFG2_READAW_CMD       0x718eu
#define MX66UW1G45G_OCTAL_READ_STATUS_CMD       0x05fau
#define MX66UW1G45G_CFG2_DOPI_ADDR              0x00000300u
#define MX66UW1G45G_CFG2_DOPI_VALUE             0x00u
#define MX66UW1G45G_CFG2_DOPI_MASK              0x07u
#define MX66UW1G45G_CFG2_OPI_ADDR               0x00000000u
#define MX66UW1G45G_CFG2_OPI_VALUE              0x02u
#define MX66UW1G45G_CFG2_OPI_MASK               0x02u
#define MX66UW1G45G_OCTAL_READ_CMD              0xee11u
#define MX66UW1G45G_OCTAL_WRITE_CMD             0x12edu
#define MX66UW1G45G_SR_WIP                      0x01u
#define MX66UW1G45G_SR_WEL                      0x02u
#define MX66UW1G45G_DEVSIZE                     26u
#define MX66UW1G45G_CSHT                        8u
#define MX66UW1G45G_FIFO_THRESHOLD              2u
#define MX66UW1G45G_OCTAL_READ_DUMMY            20u
#define MX66UW1G45G_OCTAL_REG_DUMMY             4u

#define APS256_RESET_CMD                        0xffu
#define APS256_READ_LINEAR_BURST_CMD            0x20u
#define APS256_WRITE_LINEAR_BURST_CMD           0xa0u
#define APS256_REG_READ_CMD                     0x40u
#define APS256_REG_WRITE_CMD                    0xc0u
#define APS256_MR0_ADDR                         0x00000000u
#define APS256_MR4_ADDR                         0x00000004u
#define APS256_MR8_ADDR                         0x00000008u
#define APS256_MR0_VALUE                        0x11u
#define APS256_MR4_VALUE                        0x20u
#define APS256_MR8_VALUE                        0x40u
#define APS256_REG_DUMMY                        4u
#define APS256_HEXA_DUMMY                       6u
#define APS256_DEVSIZE                          24u
#define APS256_CSBOUND                          10u
#define APS256_FIFO_THRESHOLD                   2u
#define APS256_RESET_DELAY_MS                   1u

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static void stm32h7s78_psram_dcache_flush(FAR const volatile void *addr,
                                          size_t size)
{
#ifdef CONFIG_ARMV7M_DCACHE
  uintptr_t start = (uintptr_t)addr;
  uintptr_t end = start + size;

  up_clean_dcache(start, end);
  up_invalidate_dcache(start, end);
#else
  UNUSED(addr);
  UNUSED(size);
#endif
}

static uint32_t stm32h7s78_psram_refresh(uint32_t prescaler)
{
  uint32_t xspi_hz;
  uint32_t cycles;

  xspi_hz = STM32H7RS_PLL2S_FREQUENCY / (prescaler + 1u);
  cycles = 2u * (xspi_hz / 1000000u);

  return cycles > 4u ? cycles - 4u : 0u;
}

static void stm32h7s78_xspi2_gpio_config(void)
{
  uint32_t pins = (1u << 0) | (1u << 1) | (1u << 2) | (1u << 3) |
                  (1u << 4) | (1u << 5) | (1u << 6) | (1u << 8) |
                  (1u << 9) | (1u << 10) | (1u << 11);

  modifyreg32(STM32H7RS_RCC_AHB4ENR, 0, RCC_AHB4ENR_GPIONEN);
  (void)getreg32(STM32H7RS_RCC_AHB4ENR);
  stm32h7rs_xspi_config_gpio(STM32H7RS_GPION_BASE, pins, GPIO_AF_XSPIM_P2);
}

static void stm32h7s78_xspi1_gpio_config(void)
{
  uint32_t gpioo_pins = (1u << 0) | (1u << 2) | (1u << 3) | (1u << 4);
  uint32_t gpiop_pins = (1u << 0) | (1u << 1) | (1u << 2) | (1u << 3) |
                        (1u << 4) | (1u << 5) | (1u << 6) | (1u << 7) |
                        (1u << 8) | (1u << 9) | (1u << 10) |
                        (1u << 11) | (1u << 12) | (1u << 13) |
                        (1u << 14) | (1u << 15);

  modifyreg32(STM32H7RS_RCC_AHB4ENR, 0,
              RCC_AHB4ENR_GPIOOEN | RCC_AHB4ENR_GPIOPEN);
  (void)getreg32(STM32H7RS_RCC_AHB4ENR);
  stm32h7rs_xspi_config_gpio(STM32H7RS_GPIOO_BASE, gpioo_pins,
                             GPIO_AF_XSPIM_P1);
  stm32h7rs_xspi_config_gpio(STM32H7RS_GPIOP_BASE, gpiop_pins,
                             GPIO_AF_XSPIM_P1);
}

static bool stm32h7s78_nor_id_blank(FAR const uint8_t id[3])
{
  return (id[0] == 0x00 && id[1] == 0x00 && id[2] == 0x00) ||
         (id[0] == 0xff && id[1] == 0xff && id[2] == 0xff);
}

static int stm32h7s78_nor_readid(uint8_t id[3])
{
  return stm32h7rs_xspi_read_data(STM32H7RS_XSPI2_BASE,
                                  MX66UW1G45G_READ_ID_CMD, 0,
                                  XSPI_CCR_IMODE_1_LINE |
                                  XSPI_CCR_DMODE_1_LINE,
                                  0, 3, id);
}

