FeatherCore/nuttx/boards/arm/stm32h7rs/stm32h7s78-dk/src/stm32h7s78_xspi.c
static int stm32h7s78_psram_read_reg(uint32_t address, uint8_t *value)
{
  uint8_t data[2];
  uint32_t ccr;
  int ret;

  ccr = XSPI_CCR_IMODE_8_LINES | XSPI_CCR_ADMODE_8_LINES |
        XSPI_CCR_ADDTR | XSPI_CCR_ADSIZE_32 | XSPI_CCR_DMODE_8_LINES |
        XSPI_CCR_DDTR | XSPI_CCR_DQSE;

  ret = stm32h7rs_xspi_read_data(STM32H7RS_XSPI1_BASE,
                                 APS256_REG_READ_CMD, address, ccr,
                                 XSPI_TCR_DCYC(APS256_REG_DUMMY),
                                 sizeof(data), data);
  if (ret >= 0)
    {
      *value = data[0];
    }

  return ret;
}

static int stm32h7s78_psram_config_reg(uint32_t address, uint8_t value,
                                       uint8_t mask)
{
  uint8_t initial;
  uint8_t readback;
  uint8_t writeval;
  int ret;

  ret = stm32h7s78_psram_read_reg(address, &initial);
  if (ret < 0)
    {
      return ret;
    }

  writeval = (initial & ~mask) | (value & mask);
  ret = stm32h7s78_psram_write_reg(address, writeval);
  if (ret < 0)
    {
      return ret;
    }

  ret = stm32h7s78_psram_read_reg(address, &readback);
  if (ret < 0)
    {
      return ret;
    }

  if ((readback & mask) != (value & mask))
    {
      ferr("ERROR: PSRAM reg 0x%08" PRIx32 " readback %02x expected %02x\n",
           address, readback, value);
      syslog(LOG_ERR, "XSPI1 PSRAM MR%08" PRIx32
             " initial %02x write %02x readback %02x expected %02x\n",
             address, initial, writeval, readback, value);
      return -EIO;
    }

  syslog(LOG_INFO, "XSPI1 PSRAM MR%08" PRIx32
         " initial %02x write %02x readback %02x\n",
         address, initial, writeval, readback);
  return OK;
}

static int stm32h7s78_xspi1_enter_memory_mapped(void)
{
  uintptr_t base = STM32H7RS_XSPI1_BASE;
  uint32_t ccr;
  int ret;

  ret = stm32h7rs_xspi_set_prescaler(
    base, STM32H7S78_XSPI_PSRAM_OPTIONAL_PRESCALER);
  if (ret < 0)
    {
      return ret;
    }

  putreg32(XSPI_DCR4_REFRESH(stm32h7s78_psram_refresh(
             STM32H7S78_XSPI_PSRAM_OPTIONAL_PRESCALER)),
           STM32H7RS_XSPI_DCR4(base));

  ccr = XSPI_CCR_IMODE_8_LINES | XSPI_CCR_ADMODE_8_LINES |
        XSPI_CCR_ADDTR | XSPI_CCR_ADSIZE_32 | XSPI_CCR_DMODE_16_LINES |
        XSPI_CCR_DDTR | XSPI_CCR_DQSE;

  return stm32h7rs_xspi_enter_memory_mapped(
    base, ccr, XSPI_TCR_DCYC(APS256_HEXA_DUMMY),
    APS256_READ_LINEAR_BURST_CMD, ccr,
    XSPI_TCR_DCYC(APS256_HEXA_DUMMY),
    APS256_WRITE_LINEAR_BURST_CMD);
}

static int stm32h7s78_psram_selftest(void)
{
  volatile uint32_t *mem = (volatile uint32_t *)STM32H7RS_XSPI1_MEM_BASE;
  const uint32_t offsets[] =
    {
      0x00000000u,
      0x00000040u,
      0x00001000u,
      0x00001040u,
      0x00100000u,
      0x00ffffc0u,
      0x01ffffc0u
    };

  const uint32_t alias_offsets[] =
    {
      0x00000000u,
      0x00000040u,
      0x000000c0u,
      0x00000100u,
      0x00000140u,
      0x000001c0u,
      0x00000200u,
      0x000002c0u
    };

  uint32_t saved[8];
  uint32_t alias_saved[sizeof(alias_offsets) / sizeof(alias_offsets[0])];
  uint32_t pattern[8] =
    {
      0x55aa55aau, 0xaa55aa55u, 0x01234567u, 0x89abcdefu,
      0xf0f00f0fu, 0x0f0ff0f0u, 0x13579bdfu, 0x2468ace0u
    };

  size_t alias;
  size_t region;
  size_t restore;
  int i;

  for (region = 0; region < sizeof(offsets) / sizeof(offsets[0]); region++)
    {
      volatile uint32_t *ptr =
        (volatile uint32_t *)((uintptr_t)mem + offsets[region]);

      for (i = 0; i < 8; i++)
        {
          saved[i] = ptr[i];
        }

      for (i = 0; i < 8; i++)
        {
          ptr[i] = pattern[i];
        }

      stm32h7s78_psram_dcache_flush(ptr, sizeof(pattern));

      for (i = 0; i < 8; i++)
        {
          if (ptr[i] != pattern[i])
            {
              ferr("ERROR: PSRAM self-test[0x%08" PRIx32 "+%d] got %08"
                   PRIx32 " expected %08" PRIx32 "\n",
                   offsets[region], i * 4, ptr[i], pattern[i]);
              while (i-- > 0)
                {
                  ptr[i] = saved[i];
                }

              return -EIO;
            }
        }

      for (i = 0; i < 8; i++)
        {
          ptr[i] = saved[i];
        }

      stm32h7s78_psram_dcache_flush(ptr, sizeof(saved));
    }

  for (alias = 0;
       alias < sizeof(alias_offsets) / sizeof(alias_offsets[0]);
       alias++)
    {
      volatile uint32_t *ptr =
        (volatile uint32_t *)((uintptr_t)mem + alias_offsets[alias]);

      alias_saved[alias] = *ptr;
      *ptr = STM32H7RS_XSPI1_MEM_BASE + alias_offsets[alias];
    }

  stm32h7s78_psram_dcache_flush(mem, 0x300);

  for (alias = 0;
       alias < sizeof(alias_offsets) / sizeof(alias_offsets[0]);
       alias++)
    {
      volatile uint32_t *ptr =
        (volatile uint32_t *)((uintptr_t)mem + alias_offsets[alias]);
      uint32_t expected = STM32H7RS_XSPI1_MEM_BASE + alias_offsets[alias];

      if (*ptr != expected)
        {
          ferr("ERROR: PSRAM address self-test[0x%08" PRIx32
               "] got %08" PRIx32 " expected %08" PRIx32 "\n",
               alias_offsets[alias], *ptr, expected);
          for (restore = 0;
               restore < sizeof(alias_offsets) / sizeof(alias_offsets[0]);
               restore++)
            {
              ptr = (volatile uint32_t *)((uintptr_t)mem +
                                          alias_offsets[restore]);
              *ptr = alias_saved[restore];
            }

          return -EIO;
        }
    }

  for (alias = 0;
       alias < sizeof(alias_offsets) / sizeof(alias_offsets[0]);
       alias++)
    {
      volatile uint32_t *ptr =
        (volatile uint32_t *)((uintptr_t)mem + alias_offsets[alias]);

      *ptr = alias_saved[alias];
    }

  stm32h7s78_psram_dcache_flush(mem, 0x300);

  syslog(LOG_INFO, "XSPI1 PSRAM self-test passed\n");
  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int stm32h7s78_xspi2_nor_initialize(void)
{
  static const struct stm32h7rs_xspi_config_s nor_config =
    {
      .base           = STM32H7RS_XSPI2_BASE,
      .reset          = RCC_AHB5RSTR_XSPI2RST,
      .memory_type    = XSPI_DCR1_MTYP_MACRONIX,
      .device_size    = MX66UW1G45G_DEVSIZE,
      .csht           = MX66UW1G45G_CSHT,
      .prescaler      = STM32H7S78_XSPI_STARTUP_PRESCALER,
      .fifo_threshold = MX66UW1G45G_FIFO_THRESHOLD,
      .csbound        = 0,
      .maxtran        = 0,
      .refresh        = 0
    };

