FeatherCore/nuttx/boards/arm/stm32h7rs/stm32h7s78-dk/src/stm32h7s78_xspi.c
  uint8_t cfg2;
  uint32_t header;
  uint8_t id[3];
  int ret;

  if (stm32h7rs_xspi_is_mapped(STM32H7RS_XSPI2_BASE))
    {
      syslog(LOG_INFO, "XSPI2 NOR already memory-mapped\n");
      return OK;
    }

  ret = stm32h7rs_xspi_common_setup();
  if (ret < 0)
    {
      ferr("ERROR: XSPI common setup failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI2 NOR common setup failed: %d\n", ret);
      return ret;
    }

  stm32h7s78_xspi2_gpio_config();
  stm32h7rs_xspi_controller_config(&nor_config);

  /* Cube's MX66UW1G45G reset method is 6699/9966 followed by 66/99 when
   * optional octal configuration is present.  This lets the loader recover
   * a device left in Octal/DTR mode by a previous external loader or app.
   */

  ret = stm32h7rs_xspi_command(STM32H7RS_XSPI2_BASE,
                               MX66UW1G45G_OCTA_RESET_ENABLE_CMD,
                               XSPI_CCR_IMODE_8_LINES |
                               XSPI_CCR_IDTR | XSPI_CCR_ISIZE_16);
  if (ret < 0)
    {
      syslog(LOG_WARNING, "XSPI2 NOR octal reset-enable failed: %d\n",
             ret);
    }

  ret = stm32h7rs_xspi_command(STM32H7RS_XSPI2_BASE,
                               MX66UW1G45G_OCTA_RESET_MEMORY_CMD,
                               XSPI_CCR_IMODE_8_LINES |
                               XSPI_CCR_IDTR | XSPI_CCR_ISIZE_16);
  if (ret < 0)
    {
      syslog(LOG_WARNING, "XSPI2 NOR octal reset failed: %d\n", ret);
    }

  up_mdelay(STM32H7S78_XSPI_NOR_RESET_DELAY_MS);

  ret = stm32h7rs_xspi_command(STM32H7RS_XSPI2_BASE,
                               MX66UW1G45G_RESET_ENABLE_CMD,
                               XSPI_CCR_IMODE_1_LINE);
  if (ret < 0)
    {
      ferr("ERROR: XSPI2 NOR reset-enable failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI2 NOR reset-enable failed: %d\n", ret);
      return ret;
    }

  ret = stm32h7rs_xspi_command(STM32H7RS_XSPI2_BASE,
                               MX66UW1G45G_RESET_MEMORY_CMD,
                               XSPI_CCR_IMODE_1_LINE);
  if (ret < 0)
    {
      ferr("ERROR: XSPI2 NOR reset failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI2 NOR reset failed: %d\n", ret);
      return ret;
    }

  up_mdelay(STM32H7S78_XSPI_NOR_RESET_DELAY_MS);

  ret = stm32h7s78_nor_readid(id);
  if (ret < 0)
    {
      ferr("ERROR: XSPI2 NOR read-id failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI2 NOR read-id failed: %d sr=%08" PRIx32 "\n",
             ret, getreg32(STM32H7RS_XSPI_SR(STM32H7RS_XSPI2_BASE)));
      return ret;
    }

  syslog(LOG_INFO, "XSPI2 NOR JEDEC ID %02x %02x %02x\n",
         id[0], id[1], id[2]);
  if (stm32h7s78_nor_id_blank(id))
    {
      ferr("ERROR: XSPI2 NOR JEDEC ID is blank\n");
      syslog(LOG_ERR, "XSPI2 NOR JEDEC ID is blank\n");
      syslog(LOG_ERR, "XSPI2 regs CR=%08" PRIx32 " SR=%08" PRIx32
             " DCR1=%08" PRIx32 " DCR2=%08" PRIx32
             " CCR=%08" PRIx32 " TCR=%08" PRIx32
             " DLR=%08" PRIx32 "\n",
             getreg32(STM32H7RS_XSPI_CR(STM32H7RS_XSPI2_BASE)),
             getreg32(STM32H7RS_XSPI_SR(STM32H7RS_XSPI2_BASE)),
             getreg32(STM32H7RS_XSPI_DCR1(STM32H7RS_XSPI2_BASE)),
             getreg32(STM32H7RS_XSPI_DCR2(STM32H7RS_XSPI2_BASE)),
             getreg32(STM32H7RS_XSPI_CCR(STM32H7RS_XSPI2_BASE)),
             getreg32(STM32H7RS_XSPI_TCR(STM32H7RS_XSPI2_BASE)),
             getreg32(STM32H7RS_XSPI_DLR(STM32H7RS_XSPI2_BASE)));
      return -EIO;
    }

  ret = stm32h7s78_nor_config_cfg2_spi(MX66UW1G45G_CFG2_DOPI_ADDR,
                                       MX66UW1G45G_CFG2_DOPI_VALUE,
                                       MX66UW1G45G_CFG2_DOPI_MASK);
  if (ret < 0)
    {
      ferr("ERROR: XSPI2 NOR DOPI config failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI2 NOR DOPI config failed: %d\n", ret);
      return ret;
    }

  ret = stm32h7s78_nor_read_cfg2_spi(MX66UW1G45G_CFG2_OPI_ADDR, &cfg2);
  if (ret < 0)
    {
      ferr("ERROR: XSPI2 NOR OPI config read failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI2 NOR OPI config read failed: %d\n", ret);
      return ret;
    }

  cfg2 = (cfg2 & ~MX66UW1G45G_CFG2_OPI_MASK) |
         (MX66UW1G45G_CFG2_OPI_VALUE & MX66UW1G45G_CFG2_OPI_MASK);
  ret = stm32h7s78_nor_write_cfg2_spi(MX66UW1G45G_CFG2_OPI_ADDR, cfg2,
                                      false);
  if (ret < 0)
    {
      ferr("ERROR: XSPI2 NOR OPI config write failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI2 NOR OPI config write failed: %d\n", ret);
      return ret;
    }

  ret = stm32h7rs_xspi_set_prescaler(
    STM32H7RS_XSPI2_BASE, STM32H7S78_XSPI_NOR_OPTIONAL_PRESCALER);
  if (ret < 0)
    {
      return ret;
    }

  ret = stm32h7s78_nor_wait_wip_octal();
  if (ret < 0)
    {
      ferr("ERROR: XSPI2 NOR optional WIP wait failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI2 NOR optional WIP wait failed: %d\n", ret);
      return ret;
    }

  ret = stm32h7s78_nor_read_cfg2_octal(MX66UW1G45G_CFG2_OPI_ADDR, &cfg2);
  if (ret < 0)
    {
      ferr("ERROR: XSPI2 NOR optional read-after-write failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI2 NOR optional read-after-write failed: %d\n",
             ret);
      return ret;
    }

  if ((cfg2 & MX66UW1G45G_CFG2_OPI_MASK) != MX66UW1G45G_CFG2_OPI_VALUE)
    {
      ferr("ERROR: XSPI2 NOR OPI readback %02x expected %02x\n",
           cfg2, MX66UW1G45G_CFG2_OPI_VALUE);
      syslog(LOG_ERR, "XSPI2 NOR OPI readback %02x expected %02x\n",
             cfg2, MX66UW1G45G_CFG2_OPI_VALUE);
      return -EIO;
    }

  syslog(LOG_INFO, "XSPI2 NOR OPI/DTR config readback %02x\n", cfg2);

  ret = stm32h7s78_xspi2_enter_memory_mapped();
  if (ret < 0)
    {
      ferr("ERROR: XSPI2 NOR memory-map failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI2 NOR memory-map failed: %d\n", ret);
      return ret;
    }

  header = *(volatile uint32_t *)STM32H7RS_XSPI2_MEM_BASE;
  syslog(LOG_INFO, "XSPI2 NOR mapped 0x%08x header[0]=0x%08" PRIx32 "\n",
         STM32H7RS_XSPI2_MEM_BASE, header);
  return OK;
}

int stm32h7s78_xspi1_psram_initialize(void)
{
  const struct stm32h7rs_xspi_config_s psram_config =
    {
      .base           = STM32H7RS_XSPI1_BASE,
      .reset          = RCC_AHB5RSTR_XSPI1RST,
      .memory_type    = XSPI_DCR1_MTYP_APMEM_16BIT,
      .device_size    = APS256_DEVSIZE,
      .csht           = 5,
      .prescaler      = STM32H7S78_XSPI_STARTUP_PRESCALER,
      .fifo_threshold = APS256_FIFO_THRESHOLD,
      .csbound        = APS256_CSBOUND,
      .maxtran        = 0,
      .refresh        = stm32h7s78_psram_refresh(
                           STM32H7S78_XSPI_STARTUP_PRESCALER)
    };

