FeatherCore/nuttx/boards/arm/stm32h7rs/stm32h7s78-dk/src/stm32h7s78_xspi.c
  int ret;

  if (stm32h7rs_xspi_is_mapped(STM32H7RS_XSPI1_BASE))
    {
      syslog(LOG_INFO, "XSPI1 PSRAM already memory-mapped refresh=%" PRIu32
             "\n", getreg32(STM32H7RS_XSPI_DCR4(STM32H7RS_XSPI1_BASE)));

      return stm32h7s78_psram_selftest();
    }

  ret = stm32h7rs_xspi_common_setup();
  if (ret < 0)
    {
      ferr("ERROR: XSPI common setup failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI1 PSRAM common setup failed: %d\n", ret);
      return ret;
    }

  stm32h7s78_xspi1_gpio_config();
  stm32h7rs_xspi_controller_config(&psram_config);

  ret = stm32h7rs_xspi_command_addr(STM32H7RS_XSPI1_BASE,
                                    APS256_RESET_CMD, 0,
                                    XSPI_CCR_IMODE_8_LINES |
                                    XSPI_CCR_ADMODE_8_LINES |
                                    XSPI_CCR_ADSIZE_32,
                                    0);
  if (ret < 0)
    {
      ferr("ERROR: XSPI1 PSRAM reset failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI1 PSRAM reset failed: %d\n", ret);
      return ret;
    }

  up_mdelay(APS256_RESET_DELAY_MS);

  ret = stm32h7s78_psram_config_reg(APS256_MR0_ADDR, APS256_MR0_VALUE,
                                    0x3f);
  if (ret < 0)
    {
      ferr("ERROR: XSPI1 PSRAM MR0 config failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI1 PSRAM MR0 config failed: %d\n", ret);
      return ret;
    }

  ret = stm32h7s78_psram_config_reg(APS256_MR4_ADDR, APS256_MR4_VALUE,
                                    0xe0);
  if (ret < 0)
    {
      ferr("ERROR: XSPI1 PSRAM MR4 config failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI1 PSRAM MR4 config failed: %d\n", ret);
      return ret;
    }

  ret = stm32h7s78_psram_config_reg(APS256_MR8_ADDR, APS256_MR8_VALUE,
                                    0x40);
  if (ret < 0)
    {
      ferr("ERROR: XSPI1 PSRAM MR8 config failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI1 PSRAM MR8 config failed: %d\n", ret);
      return ret;
    }

  ret = stm32h7s78_xspi1_enter_memory_mapped();
  if (ret < 0)
    {
      ferr("ERROR: XSPI1 PSRAM memory-map failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI1 PSRAM memory-map failed: %d\n", ret);
      return ret;
    }

  ret = stm32h7s78_psram_selftest();
  if (ret < 0)
    {
      return ret;
    }

  syslog(LOG_INFO, "XSPI1 PSRAM mapped at 0x%08x refresh=%" PRIu32 "\n",
         STM32H7RS_XSPI1_MEM_BASE,
         getreg32(STM32H7RS_XSPI_DCR4(STM32H7RS_XSPI1_BASE)));
  return OK;
}
